<details ><summary>plan for staging 2025-03-30 01:58:02 (UTC)</summary>
        <details ><summary>Locking successful</summary>
  Project yuki-yamamura/learn-terraform-cicd#staging has been locked by PR #3
</details>

<details open="true"><summary>Plan output</summary>

```terraform
Terraform will perform the following actions:

  # aws_iam_role.eventbridge-access will be created
  + resource "aws_iam_role" "eventbridge-access" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "events.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "eventbridge-access"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────
```
</details>


<details ><summary>Terraform plan validation check (staging)</summary>
  Terraform plan validation checks succeeded :white_check_mark:
</details>


<details ><summary>Plan summary</summary>
  
| CHANGE |             RESOURCE              |
|--------|-----------------------------------|
| add    | `aws_iam_role.eventbridge-access` |

</details>

</details>